<?xml version='1.0' encoding='utf-8'?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
          "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html metal:use-macro='macros/page'>
<head>
  <title metal:fill-slot='title'>Curriculum Vitae</title>
</head>
<body>
<div metal:fill-slot='content'>

<span lang="da" xml:lang="da">
<h1>Curriculum Vitae</h1>

<p>Dette dokument blev sidst opdateret 25. april 2005, s&aring; det er
muligt jeg har lavet noget nyt og sp&aelig;ndende siden da.</p>

<h2>Personlige oplysninger</h2>

<table>
<tr><td><strong>Navn</strong></td>
    <td>Sune Kirkeby</td></tr>
<tr><td><strong>F&oslash;dt</strong></td>
    <td>7. juli 1979</td></tr>
<tr><td><strong>Bosiddende</strong></td>
    <td>K&oslash;benhavn</td></tr>
</table>

<h1>Uddannelse</h1>
<p>Jeg blev f&aelig;rdig med gymnasiet i sommeren 1998, herefter
tog jeg et &aring;rs pause fra uddannelse, fordi jeg ville
pr&oslash;ve noget andet. I l&oslash;bet af sensommeren
l&oslash;ste jeg nogle sm&aring; opgaver som
studentermedhj&aelig;lper for Berlingske Online, og blev senere
anset p&aring; fuldtid som programm&oslash;r. I september 1999
startede jeg p&aring; K&oslash;benhavns Universitet p&aring;
datalogi, hvor jeg stadig l&aelig;ser. Jeg er f&aelig;rdig med
bachelor-delen af min datalogi-uddannelse, men mangler stadig en
del af mit bifag.</p>
<h1>Evner</h1>
<p>Siden jeg blev f&aelig;rdig med gymnasiet, har jeg arbejdet
professionelt med udvikling af web-sites og drift af web-servere,
hvor jeg har arbejdet med:</p>
<ul>
<li>Perl og Python til backend-udvikling,</li>

<li>SQL (p&aring; PostgreSQL, MySQL og Oracle),</li>
<li>UNIX-administration (is&aelig;r Apache og Postfix p&aring;
Debian Linux).</li>
</ul>
<p>Derudover har jeg arbejdet lidt med C, Java og Standard ML. Og,
selvom jeg kun har arbejdet lidt med frontend-udvikling, kender jeg
HTML, XML, CSS og JavaScript rimelig godt.</p>
<p>Jeg er vant til at arbejde selvst&aelig;ndigt og seri&oslash;st
med mine opgaver, og stiller h&oslash;je krav til kvaliteten af det
jeg laver.</p>
<h1>Arbejdserfaring</h1>
<p>Jeg har arbejdet f&oslash;lgende steder:</p>
<ul>
<li>
<p>&lt;silvertag&gt; og Adamatic:</p>

<p>Fra august 2000 og frem til dags dato har jeg arbejdet i
&lt;silvertag&gt; og (da &lt;silvertag&gt; gik konkurs og Adamtic
overtog kundebasen) Adamtic, som system- og
netv&aelig;rksadministrator og programm&oslash;r.</p>
<p>Jeg har st&aring;et for den daglige drift af husets dns-, web-
og mail-servere, og s&oslash;rget for backup af disse, og udviklet
web-baserede v&aelig;rkt&oslash;jer til at lette administration af
kundernes dom&aelig;ner og e-mail-ops&aelig;tning. Derudover har
jeg udviklet et spam- og virus-filter til deres mail-servere.</p>
</li>
<li>
<p>Berlingske Online:</p>
<p>Fra midten af september 1998 til og med februar 2000 var jeg
ansat som programm&oslash;r i Berlingske Online. Jeg startede
p&aring; deltid, og blev fra december 1998 ansat p&aring; fuld tid.
Da jeg i september 1999 startede p&aring; datalogi-studiet, valgte
jeg at trappede ned til deltid, indtil jeg sagde op fordi jeg havde
brug for nogle nye udfordringer.</p>
<p>Mine opgaver var hovedsageligt programm&oslash;r, men indtil der
blev ansat en egentlig system-administrator, stod jeg ogs&aring;
for drift af husets Linux-servere. Jeg var blandt andet med til at
opbygge backend'en p&aring; www.berlingske.dk og www.jobzonen.dk,
hvor jeg stod for ops&aelig;tning af Apache og var med til at
designe databaserne og udvikle Perl-moduler til at tilg&aring;
disse. Og, mens jeg var fuldtidsansat havde jeg ansvaret for
udviklingen af artikelpublicerings-systemet til www.berlingske.dk.</p>
</li>
</ul>
</span>

</div>
</body>
</html>
